willcome0/EFR32BG22-Study/Test2/Code/test_soc_thermometer_client/app.c
          // then stop scanning for a while
          sc = sl_bt_scanner_stop();
          sl_app_assert(sc == SL_STATUS_OK,
                        "[E: 0x%04x] Failed to stop discovery\n",
                        (int)sc);
          // and connect to that device
          if (active_connections_num < SL_BT_CONFIG_MAX_CONNECTIONS) {
            sc = sl_bt_connection_open(evt->data.evt_scanner_scan_report.address,
                                       evt->data.evt_scanner_scan_report.address_type,
                                       gap_1m_phy,
                                       NULL);
            sl_app_assert(sc == SL_STATUS_OK,
                          "[E: 0x%04x] Failed to connect\n",
                          (int)sc);
            conn_state = opening;
          }
        }
      }
      break;

    // -------------------------------
    // This event is generated when a new connection is established
    case sl_bt_evt_connection_opened_id:
      // Get last two bytes of sender address
      addr_value = (uint16_t)(evt->data.evt_connection_opened.address.addr[1] << 8) + evt->data.evt_connection_opened.address.addr[0];
      // Add connection to the connection_properties array
      add_connection(evt->data.evt_connection_opened.connection, addr_value);
      // Discover Health Thermometer service on the slave device
      sc = sl_bt_gatt_discover_primary_services(evt->data.evt_connection_opened.connection);
      sl_app_assert(sc == SL_STATUS_OK,
                    "[E: 0x%04x] Failed to discover primary services\n",
                    (int)sc);

      // Set remote connection power reporting - needed for Power Control
      sc = sl_bt_connection_set_remote_power_reporting(
        evt->data.evt_connection_opened.connection,
        connection_power_reporting_enable);
      sl_app_assert(sc == SL_STATUS_OK,
                    "[E: 0x%04x] Failed to start power reporting\n",
                    (int)sc);

      conn_state = discover_services;
      break;

    // -------------------------------
    // This event is generated when a new service is discovered
    case sl_bt_evt_gatt_service_id: // 保存服务的句柄
      table_index = find_index_by_connection_handle(evt->data.evt_gatt_service.connection);
      if (table_index != TABLE_INDEX_INVALID) {
        uint8array *uuid = &(evt->data.evt_gatt_service.uuid);
         if (memcmp(uuid->data, led_service, uuid->len) == 0) {
           sl_app_log("LED service is discovered\n");
           conn_properties[table_index].led_service_handle = evt->data.evt_gatt_service.service;
         }
         else if (memcmp(uuid->data, thermo_service, uuid->len) == 0) {
           sl_app_log("Thermometer service is discovered\n");
           conn_properties[table_index].thermometer_service_handle = evt->data.evt_gatt_service.service;
           sl_bt_gatt_discover_primary_services_by_uuid(evt->data.evt_connection_opened.connection,
                                                                   sizeof(led_service),
                                                                   (const uint8_t*)led_service);
         }
      }
      break;

    // -------------------------------
    // This event is generated when a new characteristic is discovered
    case sl_bt_evt_gatt_characteristic_id: // 保存特征值的句柄
      table_index = find_index_by_connection_handle(evt->data.evt_gatt_characteristic.connection);
      if (table_index != TABLE_INDEX_INVALID) {
        uint8array *uuid = &(evt->data.evt_gatt_characteristic.uuid);
        if (memcmp(uuid->data, led_char, uuid->len) == 0) {
          sl_app_log("LED characteristic is discovered\n");
          conn_properties[table_index].led_characteristic_handle = evt->data.evt_gatt_characteristic.characteristic;
        }
        else if (memcmp(uuid->data, thermo_char, uuid->len) == 0) {
          sl_app_log("Thermometer characteristic is discovered\n");
          conn_properties[table_index].thermometer_characteristic_handle = evt->data.evt_gatt_characteristic.characteristic;
        }
      }
      break;

    // -------------------------------
    // This event is generated for various procedure completions, e.g. when a
    // write procedure is completed, or service discovery is completed
    case sl_bt_evt_gatt_procedure_completed_id:
      table_index = find_index_by_connection_handle(evt->data.evt_gatt_procedure_completed.connection);
      if (table_index == TABLE_INDEX_INVALID) {
        break;
      }
      // If service discovery finished
      if (conn_state == discover_services 
          && conn_properties[table_index].led_service_handle != SERVICE_HANDLE_INVALID
          && conn_properties[table_index].thermometer_service_handle != SERVICE_HANDLE_INVALID) {
        // Discover thermometer characteristic on the slave device
        if (conn_properties[table_index].led_characteristic_handle == CHARACTERISTIC_HANDLE_INVALID) {
            sl_bt_gatt_discover_characteristics(evt->data.evt_gatt_procedure_completed.connection,
                                               conn_properties[table_index].led_service_handle);
        }
        else if (conn_properties[table_index].thermometer_characteristic_handle == CHARACTERISTIC_HANDLE_INVALID) {
            sl_bt_gatt_discover_characteristics(evt->data.evt_gatt_procedure_completed.connection,
                                               conn_properties[table_index].thermometer_service_handle);
        }
        else {
            conn_state = discover_characteristics;
        }
      }
      // If characteristic discovery finished
      if (conn_state == discover_characteristics
          && conn_properties[table_index].led_characteristic_handle != CHARACTERISTIC_HANDLE_INVALID
          && conn_properties[table_index].thermometer_characteristic_handle != CHARACTERISTIC_HANDLE_INVALID) {
        // stop discovering
        sl_bt_scanner_stop();
        sl_app_log("Stop discover characteristic\n");
        // enable indications
        sc = sl_bt_gatt_set_characteristic_notification(evt->data.evt_gatt_procedure_completed.connection,
                                                        conn_properties[table_index].thermometer_characteristic_handle,
                                                        gatt_indication);
        sl_app_assert(sc == SL_STATUS_OK,
                      "[E: 0x%04x] Failed to set characteristic notification\n",
                      (int)sc);
        conn_state = enable_indication;
        break;
      }
      // If indication enable process finished
      if (conn_state == enable_indication) {
        // and we can connect to more devices
        if (active_connections_num < SL_BT_CONFIG_MAX_CONNECTIONS) {
          // start scanning again to find new devices
          sc = sl_bt_scanner_start(gap_1m_phy, scanner_discover_generic);
          sl_app_assert(sc == SL_STATUS_OK,
                        "[E: 0x%04x] Failed to start discovery #2\n",
                        (int)sc);
          conn_state = scanning;
        } else {
          conn_state = running;
        }
        break;
      }
      break;

    // -------------------------------
    // This event is generated when a connection is dropped
    case sl_bt_evt_connection_closed_id:
      // remove connection from active connections
      remove_connection(evt->data.evt_connection_closed.connection);
      if (conn_state != scanning) {
        // start scanning again to find new devices
        sc = sl_bt_scanner_start(gap_1m_phy, scanner_discover_generic);
        sl_app_assert(sc == SL_STATUS_OK,
                      "[E: 0x%04x] Failed to start discovery #3\n",
                      (int)sc);
        conn_state = scanning;
      }
      break;

    // -------------------------------
    // This event is generated when a characteristic value was received e.g. an indication
    case sl_bt_evt_gatt_characteristic_value_id:
      if (evt->data.evt_gatt_characteristic_value.value.len >= 5) {
        char_value = &(evt->data.evt_gatt_characteristic_value.value.data[0]);
        table_index = find_index_by_connection_handle(evt->data.evt_gatt_characteristic_value.connection);
        if (table_index != TABLE_INDEX_INVALID) {
          conn_properties[table_index].temperature = translate_IEEE_11073_temperature_to_float((IEEE_11073_float *)(char_value + 1));
          conn_properties[table_index].unit = translate_flags_to_temperature_unit(char_value[0]);
        }
      } else {
        sl_app_log("Characteristic value too short: %d\n", evt->data.evt_gatt_characteristic_value.value.len);
      }
      // Send confirmation for the indication
      sc = sl_bt_gatt_send_characteristic_confirmation(evt->data.evt_gatt_characteristic_value.connection);
      sl_app_assert(sc == SL_STATUS_OK,
                    "[E: 0x%04x] Failed to send characteristic confirmation\n",
                    (int)sc);
      // Trigger RSSI measurement on the connection
      sc = sl_bt_connection_get_rssi(evt->data.evt_gatt_characteristic_value.connection);
      sl_app_assert(sc == SL_STATUS_OK,
                    "[E: 0x%04x] Failed to get RSSI\n",
                    (int)sc);
      break;

    // -------------------------------
    // This event is generated when RSSI value was measured
    case sl_bt_evt_connection_rssi_id:
      table_index = find_index_by_connection_handle(evt->data.evt_connection_rssi.connection);
      if (table_index != TABLE_INDEX_INVALID) {
        conn_properties[table_index].rssi = evt->data.evt_connection_rssi.rssi;
      }

      print_values();
      break;

    // -------------------------------
    // TX Power is updated
    case sl_bt_evt_connection_tx_power_id:

